esaatci/Embedded_Code/gtcam_stm32l4_mlx/Src/SparkFun_GridEYE_Arduino_Library.c
void GridEYE_setFramerate1FPS()
{
    GridEYE_setRegister(FRAMERATE_REGISTER, 1);
}

void GridEYE_setFramerate10FPS()
{
    GridEYE_setRegister(FRAMERATE_REGISTER, 0);
}

bool GridEYE_isFramerate10FPS()
{

    if(GridEYE_getRegister(FRAMERATE_REGISTER, 1) == 0){
      return true;
    }else{
      return false;
    }
  
}

/********************************************************
 * Functions for manipulating Operating Mode
 ******************************************************** 
 * 
 * Device defaults to normal mode on reset. 
 * When the device is in standby mode, the temperature
 * register is only updated intermittently.
 * 
 * wake() - returns device to normal mode from any
 *    other state.
 *    
 * sleep() - puts device into sleep mode, temperature
 *    register is not updated
 * 
 * standby60seconds() - puts device into standby mode
 *    with 60 second update frequency
 *    
 * standby10seconds() - puts device into standby mode
 *    with 10 second update frequency
 *    
 ********************************************************/

void GridEYE_wake(){

    GridEYE_setRegister(POWER_CONTROL_REGISTER, 0x00);
  
}

void GridEYE_sleep(){

    GridEYE_setRegister(POWER_CONTROL_REGISTER, 0x10);
  
}

void GridEYE_standby60seconds(){

    GridEYE_setRegister(POWER_CONTROL_REGISTER, 0x20);
  
}

void GridEYE_standby10seconds(){

    GridEYE_setRegister(POWER_CONTROL_REGISTER, 0x21);
  
}

/********************************************************
 * Functions for manipulating Interrupt Control Register
 ******************************************************** 
 * 
 * interruptPinEnable() - Enable INT pin to pull low on 
 *    interrupt flag
 *    
 * interruptPinDisable() - Put INT pin into Hi-Z state
 * 
 * setInterruptModeAbsolute() - Set interrupt mode to
 *    "Absolute Value" mode
 *    
 * setInterruptModeDifference() - Set interrupt mode to
 *    "Difference" mode
 *    
 * interruptPinEnabled() - returns true if the INT pin
 *    is enabled. Returns false if INT pin is in Hi-Z 
 * 
 ********************************************************/

void GridEYE_interruptPinEnable(){

    int16_t ICRValue = GridEYE_getRegister(INT_CONTROL_REGISTER, 1);
    
    ICRValue |= (1 << 0);
    
    GridEYE_setRegister(INT_CONTROL_REGISTER, ICRValue & 0xFF);
  
}

void GridEYE_interruptPinDisable(){

    int16_t ICRValue = GridEYE_getRegister(INT_CONTROL_REGISTER, 1);
    
    ICRValue &= ~(1 << 0);
    
    GridEYE_setRegister(INT_CONTROL_REGISTER, ICRValue & 0xFF);
  
}

void GridEYE_setInterruptModeAbsolute(){

    int16_t ICRValue = GridEYE_getRegister(INT_CONTROL_REGISTER, 1);
    
    ICRValue |= (1 << 1);
    
    GridEYE_setRegister(INT_CONTROL_REGISTER, ICRValue & 0xFF);
   
}

void GridEYE_setInterruptModeDifference(){

    int16_t ICRValue = GridEYE_getRegister(INT_CONTROL_REGISTER, 1);
    
    ICRValue &= ~(1 << 1);
    
    GridEYE_setRegister(INT_CONTROL_REGISTER, ICRValue & 0xFF);
  
}

bool GridEYE_interruptPinEnabled(){

  int16_t ICRValue = GridEYE_getRegister(INT_CONTROL_REGISTER, 1);
  if(ICRValue & (1 << 0)){
    return true;
  }else{
    return false;
  }
  
}

/********************************************************
 * Functions for manipulating Status/Clear Registers
 ******************************************************** 
 * 
 * interruptFlagSet() - returns true if there is an 
 *    interrupt flag in the status register
 *    
 * pixelTemperatureOutputOK() - returns false if temperature
 *    output overflow flag is present in status register
 * 
 * deviceTemperatureOutputOK() - returns false if thermistor
 *    output overflow flag is present in status register
 *    
 * clearInterruptFlag() - clears interrupt flag in the 
 *    status register
 *    
 * clearPixelTemperatureOverflow() - clears temperature
 *    output overflow flag in status register
 *    
 * clearDeviceTemperatureOverflow() - clears thermistor
 *    output overflow flag in status register
 *    
 * clearAllOverflow() - clears both thermistor and 
 *    temperature overflow flags in status register but
 *    leaves interrupt flag untouched
 *    
 * clearAllStatusFlags() - clears all flags in status 
 *    register
 * 
 ********************************************************/

bool GridEYE_interruptFlagSet(){

  int16_t StatRegValue = GridEYE_getRegister(STATUS_REGISTER, 1);
  if(StatRegValue & (1 << 1)){
    return true;
  }else{
    return false;
  }  
  
}

bool GridEYE_pixelTemperatureOutputOK(){

  int16_t StatRegValue = GridEYE_getRegister(STATUS_REGISTER, 1);
  if(StatRegValue & (1 << 2)){
    return false;
  }else{
    return true;
  }  
  
}

bool GridEYE_deviceTemperatureOutputOK(){

  int16_t StatRegValue = GridEYE_getRegister(STATUS_REGISTER, 1);
  if(StatRegValue & (1 << 3)){
    return false;
  }else{
    return true;
  }  
  
}

void GridEYE_clearInterruptFlag(){
    
    GridEYE_setRegister(STATUS_CLEAR_REGISTER, 0x02);
  
}

void GridEYE_clearPixelTemperatureOverflow(){
    
    GridEYE_setRegister(STATUS_CLEAR_REGISTER, 0x04);
  
}

void GridEYE_clearDeviceTemperatureOverflow(){
    
    GridEYE_setRegister(STATUS_CLEAR_REGISTER, 0x08);
  
}

void GridEYE_clearAllOverflow(){

    GridEYE_setRegister(STATUS_CLEAR_REGISTER, 0x0C);
  
}

void GridEYE_clearAllStatusFlags(){

    GridEYE_setRegister(STATUS_CLEAR_REGISTER, 0x0E);
  
}

/********************************************************
 * Function for reading Interrupt Table Register
 ******************************************************** 
 * 
 * pixelInterruptSet() - Returns true if interrupt flag 
 * is set for the specified pixel
 * 
 ********************************************************/

bool GridEYE_pixelInterruptSet(uint8_t pixelAddr){

  unsigned char interruptTableRegister = INT_TABLE_REGISTER_INT0 + (pixelAddr / 8);
  uint8_t pixelPosition = (pixelAddr % 8);

  int16_t interruptTableRow = GridEYE_getRegister(interruptTableRegister, 1);

  if(interruptTableRow & (1 << pixelPosition)){
    return true;
  }else{
    return false;
  }    

