esaatci/Embedded_Code/gtcam_stm32l4_mlx/Src/SparkFun_GridEYE_Arduino_Library.c
}

/********************************************************
 * Functions for manipulating Average Register
 ******************************************************** 
 * 
 * Moving Average Mode enable and disable are only 
 * referenced in some of the documentation for this 
 * device but not in all documentation. Requires writing
 * in sequence to a reserved register. I'm not sure it 
 * does anything.
 * 
 * movingAverageEnable() - enable "Twice Moving Average" 
 * 
 * movingAverageDisable() - disable "Twice Moving Average"
 * 
 * movingAverageEnabled() - returns true if enabled
 * 
 ********************************************************/

void GridEYE_movingAverageEnable(){

    GridEYE_setRegister(RESERVED_AVERAGE_REGISTER, 0x50);
    GridEYE_setRegister(RESERVED_AVERAGE_REGISTER, 0x45);
    GridEYE_setRegister(RESERVED_AVERAGE_REGISTER, 0x57);
    GridEYE_setRegister(AVERAGE_REGISTER, 0x20);
    GridEYE_setRegister(RESERVED_AVERAGE_REGISTER, 0x00);
  
}

void GridEYE_movingAverageDisable(){

    GridEYE_setRegister(RESERVED_AVERAGE_REGISTER, 0x50);
    GridEYE_setRegister(RESERVED_AVERAGE_REGISTER, 0x45);
    GridEYE_setRegister(RESERVED_AVERAGE_REGISTER, 0x57);
    GridEYE_setRegister(AVERAGE_REGISTER, 0x00);
    GridEYE_setRegister(RESERVED_AVERAGE_REGISTER, 0x00);
  
}

bool GridEYE_movingAverageEnabled(){

  int16_t AVGRegValue = GridEYE_getRegister(AVERAGE_REGISTER, 1);
  if(AVGRegValue & (1 << 5)){
    return true;
  }else{
    return false;
  }  
  
}

/********************************************************
 * Functions for manipulating Interrupt Level Register
 ******************************************************** 
 * 
 * setUpperInterruptValue() - accepts float Celsius 
 * 
 * setUpperInterruptValueRaw() - accepts int16_t register
 *    configuration
 * 
 * setUpperInterruptValueFahrenheit() - accepts float 
 *    Fahrenheit
 *  
 * setLowerInterruptValue() - accepts float Celsius 
 * 
 * setLowerInterruptValueRaw() - accepts int16_t register
 *    configuration
 * 
 * setLowerInterruptValueFahrenheit() - accepts float 
 *    Fahrenheit
 * 
 * setInterruptHysteresis() - accepts float Celsius
 * 
 * setInterruptHysteresisRaw() - accepts int16_t register
 *    configuration
 * 
 * setInterruptHysteresisFahrenheit() - accepts float 
 *    Fahrenheit
 *    
 * getUpperInterruptValue() - returns float Celsius 
 * 
 * getUpperInterruptValueRaw() - returns int16_t register
 *    contents
 * 
 * getUpperInterruptValueFahrenheit() - returns float 
 *    Fahrenheit
 *  
 * getLowerInterruptValue() - returns float Celsius 
 * 
 * getLowerInterruptValueRaw() - returns int16_t register
 *    contents
 * 
 * getLowerInterruptValueFahrenheit() - returns float 
 *    Fahrenheit
 * 
 * getInterruptHysteresis() - returns float Celsius
 * 
 * getInterruptHysteresisRaw() - returns int16_t register
 *    contents
 * 
 * getInterruptHysteresisFahrenheit() - returns float 
 *    Fahrenheit   
 * 
 ********************************************************/

void GridEYE_setUpperInterruptValue(float DegreesC){

  bool isNegative = false;

  if(DegreesC < 0){
    DegreesC = abs(DegreesC);
    isNegative = true;
  }
  
  int16_t temperature = 0;  
  temperature = round(DegreesC*4);

  if(isNegative){
    temperature = 0 - temperature;
    temperature |= (1 << 11);
  }
  
  GridEYE_setRegister(INT_LEVEL_REGISTER_UPPER_LSB, temperature & 0xFF);
  GridEYE_setRegister(INT_LEVEL_REGISTER_UPPER_MSB, temperature >> 8);
  
}

void GridEYE_setUpperInterruptValueRaw(int16_t regValue){
  
  GridEYE_setRegister(INT_LEVEL_REGISTER_UPPER_LSB, regValue & 0xFF);
  GridEYE_setRegister(INT_LEVEL_REGISTER_UPPER_MSB, regValue >> 8);
  
}

void GridEYE_setUpperInterruptValueFahrenheit(float DegreesF){

  bool isNegative = false;

  float DegreesC = (DegreesF - 32) / 1.8;

  if(DegreesC < 0){
    DegreesC = abs(DegreesC);
    isNegative = true;
  }
  
  int16_t temperature = 0;  
  temperature = round(DegreesC*4);

  if(isNegative){
    temperature = 0 - temperature;
    temperature |= (1 << 11);
  }
  
  GridEYE_setRegister(INT_LEVEL_REGISTER_UPPER_LSB, temperature & 0xFF);
  GridEYE_setRegister(INT_LEVEL_REGISTER_UPPER_MSB, temperature >> 8);
  
}

void GridEYE_setLowerInterruptValue(float DegreesC){

  bool isNegative = false;

  if(DegreesC < 0){
    DegreesC = abs(DegreesC);
    isNegative = true;
  }
  
  int16_t temperature = 0;  
  temperature = round(DegreesC*4);

  if(isNegative){
    temperature = 0 - temperature;
    temperature |= (1 << 11);
  }
  
  GridEYE_setRegister(INT_LEVEL_REGISTER_LOWER_LSB, temperature & 0xFF);
  GridEYE_setRegister(INT_LEVEL_REGISTER_LOWER_MSB, temperature >> 8);
  
}

void GridEYE_setLowerInterruptValueRaw(int16_t regValue){

  GridEYE_setRegister(INT_LEVEL_REGISTER_LOWER_LSB, regValue & 0xFF);
  GridEYE_setRegister(INT_LEVEL_REGISTER_LOWER_MSB, regValue >> 8);
  
}

void GridEYE_setLowerInterruptValueFahrenheit(float DegreesF){

  bool isNegative = false;

  float DegreesC = (DegreesF - 32) / 1.8;

  if(DegreesC < 0){
    DegreesC = abs(DegreesC);
    isNegative = true;
  }
  
  int16_t temperature = 0;  
  temperature = round(DegreesC*4);

  if(isNegative){
    temperature = 0 - temperature;
    temperature |= (1 << 11);
  }
  
  GridEYE_setRegister(INT_LEVEL_REGISTER_LOWER_LSB, temperature & 0xFF);
  GridEYE_setRegister(INT_LEVEL_REGISTER_LOWER_MSB, temperature >> 8);
  
}

void GridEYE_setInterruptHysteresis(float DegreesC){

  bool isNegative = false;

  if(DegreesC < 0){
    DegreesC = abs(DegreesC);
    isNegative = true;
  }
  
  int16_t temperature = 0;  
  temperature = round(DegreesC*4);

  if(isNegative){
    temperature = 0 - temperature;
    temperature |= (1 << 11);
  }
  
  GridEYE_setRegister(INT_LEVEL_REGISTER_HYST_LSB, temperature & 0xFF);
  GridEYE_setRegister(INT_LEVEL_REGISTER_HYST_MSB, temperature >> 8);
  
}

void GridEYE_setInterruptHysteresisRaw(int16_t regValue){
  
  GridEYE_setRegister(INT_LEVEL_REGISTER_HYST_LSB, regValue & 0xFF);
  GridEYE_setRegister(INT_LEVEL_REGISTER_HYST_MSB, regValue >> 8);
  
