esaatci/Embedded_Code/gtcam_stm32l4_mlx/Src/SparkFun_GridEYE_Arduino_Library.c
}

void GridEYE_setInterruptHysteresisFahrenheit(float DegreesF){

  bool isNegative = false;

  float DegreesC = (DegreesF - 32) / 1.8;

  if(DegreesC < 0){
    DegreesC = abs(DegreesC);
    isNegative = true;
  }
  
  int16_t temperature = 0;  
  temperature = round(DegreesC*4);

  if(isNegative){
    temperature = 0 - temperature;
    temperature |= (1 << 11);
  }
  
  GridEYE_setRegister(INT_LEVEL_REGISTER_HYST_LSB, temperature & 0xFF);
  GridEYE_setRegister(INT_LEVEL_REGISTER_HYST_MSB, temperature >> 8);
  
}

float GridEYE_getUpperInterruptValue()
{

  int16_t temperature = GridEYE_getRegister(INT_LEVEL_REGISTER_UPPER_LSB, 2);

  // temperature is reported as 12-bit twos complement
  // check if temperature is negative
  if(temperature & (1 << 11))
  {
    // if temperature is negative, mask out the sign byte and 
    // make the float negative
    temperature &= ~(1 << 11);
    temperature = temperature * -1;
  }

  float DegreesC = temperature * 0.25;

  return DegreesC;

}

int16_t GridEYE_getUpperInterruptValueRaw()
{

  return GridEYE_getRegister(INT_LEVEL_REGISTER_UPPER_LSB, 2);

}

float GridEYE_getUpperInterruptValueFahrenheit()
{

  int16_t temperature = GridEYE_getRegister(INT_LEVEL_REGISTER_UPPER_LSB, 2);

  // temperature is reported as 12-bit twos complement
  // check if temperature is negative
  if(temperature & (1 << 11))
  {
    // if temperature is negative, mask out the sign byte and 
    // make the float negative
    temperature &= ~(1 << 11);
    temperature = temperature * -1;
  }

  float DegreesF = (temperature * 0.25) * 1.8 + 32;

  return DegreesF;

}

float GridEYE_getLowerInterruptValue()
{

  int16_t temperature = GridEYE_getRegister(INT_LEVEL_REGISTER_LOWER_LSB, 2);

  // temperature is reported as 12-bit twos complement
  // check if temperature is negative
  if(temperature & (1 << 11))
  {
    // if temperature is negative, mask out the sign byte and 
    // make the float negative
    temperature &= ~(1 << 11);
    temperature = temperature * -1;
  }

  float DegreesC = temperature * 0.25;

  return DegreesC;

}

float GridEYE_getLowerInterruptValueFahrenheit()
{

  int16_t temperature = GridEYE_getRegister(INT_LEVEL_REGISTER_LOWER_LSB, 2);

  // temperature is reported as 12-bit twos complement
  // check if temperature is negative
  if(temperature & (1 << 11))
  {
    // if temperature is negative, mask out the sign byte and 
    // make the float negative
    temperature &= ~(1 << 11);
    temperature = temperature * -1;
  }

  float DegreesF = (temperature * 0.25) * 1.8 + 32;

  return DegreesF;

}

int16_t GridEYE_getLowerInterruptValueRaw()
{

  return GridEYE_getRegister(INT_LEVEL_REGISTER_LOWER_LSB, 2);

}

float GridEYE_getInterruptHysteresis()
{

  int16_t temperature = GridEYE_getRegister(INT_LEVEL_REGISTER_HYST_LSB, 2);

  // temperature is reported as 12-bit twos complement
  // check if temperature is negative
  if(temperature & (1 << 11))
  {
    // if temperature is negative, mask out the sign byte and 
    // make the float negative
    temperature &= ~(1 << 11);
    temperature = temperature * -1;
  }

  float DegreesC = temperature * 0.25;

  return DegreesC;

}

float GridEYE_getInterruptHysteresisFahrenheit()
{

  int16_t temperature = GridEYE_getRegister(INT_LEVEL_REGISTER_HYST_LSB, 2);

  // temperature is reported as 12-bit twos complement
  // check if temperature is negative
  if(temperature & (1 << 11))
  {
    // if temperature is negative, mask out the sign byte and 
    // make the float negative
    temperature &= ~(1 << 11);
    temperature = temperature * -1;
  }

  float DegreesF = (temperature * 0.25) * 1.8 + 32;

  return DegreesF;

}

int16_t GridEYE_getInterruptHysteresisRaw()
{

  return GridEYE_getRegister(INT_LEVEL_REGISTER_HYST_LSB, 2);

}

/********************************************************
 * Functions for setting and getting registers over I2C
 ******************************************************** 
 * 
 * GridEYE_setRegister() - set unsigned char value at unsigned char register
 * 
 * GridEYE_getRegister() - get up to INT16 value from unsigned char register
 * 
 ********************************************************/

void GridEYE_GridEYE_setRegister(unsigned char reg, unsigned char val)
{

	HAL_StatusTypeDef status;
	/*
    _i2cPort->beginTransmission(_deviceAddress);
    _i2cPort->write(reg);
    _i2cPort->write(val);
    _i2cPort->endTransmission();
    */
    
	status =  HAL_I2C_Mem_Write(&_i2cPort,_deviceAddress<<1,reg,
    		I2C_MEMADD_SIZE_8BIT,(uint8_t *)&val,sizeof(val),100);

    if(status != HAL_OK) {
    	//BSP_LED_On(LED2);
    }

}

int16_t GridEYE_getRegister(unsigned char reg, int8_t len)
{
  int16_t result = 0;
  HAL_StatusTypeDef status=0;
  /*
    _i2cPort->beginTransmission(_deviceAddress);
    _i2cPort->write(reg);
    _i2cPort->endTransmission(false);
    _i2cPort->requestFrom((uint8_t)_deviceAddress, (uint8_t)len);
    */

  uint8_t lsb = 0;
  uint8_t msb = 0;
  /*ad hoc implementation only works with 2 bytes or fewer*/
  if(len == 1) {
	  status = HAL_I2C_Mem_Read(&_i2cPort,_deviceAddress<<1,reg,
			  I2C_MEMADD_SIZE_8BIT,(uint8_t *)&result,len,10);
  }
  else {
	  status = HAL_I2C_Mem_Read(&_i2cPort,_deviceAddress<<1,reg,
			  I2C_MEMADD_SIZE_8BIT,(uint8_t *)&lsb,1,10);
	  status = HAL_I2C_Mem_Read(&_i2cPort,_deviceAddress<<1,reg+1,
			  I2C_MEMADD_SIZE_8BIT,(uint8_t *)&msb,1,10);
	  result = (uint16_t) msb << 8 | lsb;
  }

  if(status != HAL_OK) {
	  //BSP_LED_On(LED2);
  }

    /*
    while(_i2cPort->available())    // client may send less than requested
    {
      // Get bytes from sensor
      uint8_t lsb = _i2cPort->read(); 
      uint8_t msb = _i2cPort->read(); 
  
      // concat bytes into int
      result = (uint16_t)msb << 8 | lsb;
    }

    _i2cPort->endTransmission();
    */
  //result = (uint16_t)buffer[1] << 8 | buffer[0];

    return result;
                         
}
